package com.lovecws.mumu.flink.streaming.task.atd;

import org.junit.Test;

/**
 * @program: trunk
 * @description: ${description}
 * @author: 甘亮
 * @create: 2019-11-04 14:41
 **/
public class AtdEventTaskTest {

    @Test
    public void parseData() {
        String line = "^2^2019-10-29 15:31:54^ATD^172.31.132.190^NDE^d6c35ed9-b904-4156-835e-d9b904415634^10080002^网络扫描^地址扫描^^172.31.132.21^0^^111.180.247.146^0^^tcp^other^扫描探测^c2Nhbm5lZCBwb3J0OiAyMS90Y3A=^^3^7^^local^duration:5.817215;number:28;sample:111.180.246.194, 223.77.225.143, 111.180.244.37, 111.180.246.250, 111.180.246.168, 111.180.247.146, 223.77.225.110, 223.77.231.74, 111.180.253.188, 27.28.252.222, 223.77.236.42, 111.180.243.34, 111.180.249.8, 223.77.226.152, 27.28.255.50;^Address scan^局域网地址^*^*^*^*^30.5927,114.3052^CN^中国^湖北省^神农架林区^*^CHINANET-BACKBONE^30.5927,114.3052^CN^^^^^^^^^^^^^^^^^^^^^^28^5.817215^111.180.246.194, 223.77.225.143, 111.180.244.37, 111.180.246.250, 111.180.246.168, 111.180.247.146, 223.77.225.110, 223.77.231.74, 111.180.253.188, 27.28.252.222, 223.77.236.42, 111.180.243.34, 111.180.249.8, 223.77.226.152, 27.28.255.50^^^^^^^^^^^^^^^^^^^^^^^^^2019-10-30 11:11:53";
        String[] lineFields = line.toString().split("\\^");
        for (int i = 0; i < lineFields.length; i++) {
            System.out.println("i=" + i + ";field=" + lineFields[i]);
        }
    }
}
